tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "jpeg-xl"
brew "coreutils"
brew "asdf"
brew "curl"
brew "tesseract"
brew "ffmpeg"
brew "file-formula"
brew "git"
cask "raycast"
cask "warp"
brew "dust"
brew "bat"
brew "lsd"
brew "duf"
brew "procs"
brew "bottom"
brew "httpie"
tap "homebrew/cask-fonts"
brew "font-hack-nerd-font"
brew "font-hackgen"
brew "font-hackgen-nerd"