tap "cloudflare/cloudflare"
tap "go-to-k/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "supabase/tap"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "git"
brew "asdf"
brew "libgit2"
brew "bat"
brew "binutils"
brew "bottom"
brew "cloudflared", link: false
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "cpanminus"
brew "crf++"
brew "curl"
brew "difftastic"
brew "gcc"
brew "openblas"
brew "dlib"
brew "duf"
brew "dust"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "flyctl"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "ncurses"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "infracost"
brew "jq"
brew "libfido2"
brew "libmagic"
brew "libpq"
brew "lsd"
brew "mysql"
brew "mysql-client"
brew "ncdu"
brew "nkf"
brew "openh264"
brew "perl"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "procs"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "rye"
brew "sparse"
brew "starship"
brew "tcl-tk"
brew "terraform-docs"
brew "tldr"
brew "tree"
brew "uv"
brew "websocat"
brew "wget"
brew "yq"
brew "go-to-k/tap/delstack"
brew "supabase/tap/supabase"
cask "dbeaver-community"
cask "docker"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "google-cloud-sdk"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "raycast"
cask "utm"
cask "warp"
vscode "adpyke.vscode-sql-formatter"
vscode "analytic-signal.preview-mp4"
vscode "anthropic.claude-code"
vscode "anysphere.pyright"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "leodevbro.blockman"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "philosowaffle.openapi-designer"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tsutsu3.markdown-named-codeblocks"
vscode "typespec.typespec-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
